#include "stdafx.h"
#include "JellyMgr.h"
#include "JellyFactory.h"


CJellyMgr* CJellyMgr::m_pInstance = nullptr;

CJellyMgr::CJellyMgr()
{
}


CJellyMgr::~CJellyMgr()
{
	Release();
}

void CJellyMgr::Initialize(void)
{
	INFO tJellyInfo[314] =
	{
	{ 820,440,40,60 },		//대 점프
	{ 900,440,40,60 },
	{ 980,440,40,60 },
	{ 1060,440,40,60 },
	{ 1140,440,40,60 },
	{ 1220,440,40,60 },
	{ 1270,400,40,60 },
	{ 1320,350,40,60 },
	{ 1370,300,40,60 },
	{ 1420,250,40,60 },
	{ 1470,220,40,60 },
	{ 1520,220,40,60 },

	{ 1570,260,40,60 },
	{ 1620,300,40,60 },
	{ 1660,350,40,60 },
	{ 1700,400,40,60 },
	{ 1740,440,40,60 },
	{ 1780,440,40,60 },					//17
	{},{},{},{},{},{},{},{},{},{},{}, //29



	{ 2960,450,40,60},					// 소점프
	{ 3010,400,40,60 },
	{ 3060,350,40,60 },
	{ 3110,300,40,60 },
	{ 3160,300,40,60 },
	{ 3210,350,40,60 },
	{ 3260,400,40,60 },
	{ 3310,450,40,60 },
	{ 3360,450,40,60 },					// 38
	{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}, // 63

	{ 2000,400,40,60},
	{ 2000,400,40,60 },
	{ 2000,370,40,60 },
	{ 2000,340,40,60 },
	{ 2000,310,40,60 },
	{ 2050,400,40,60 },
	{ 2050,370,40,60 },
	{ 2050,340,40,60 },
	{ 2050,310,40,60 },
	{ 2100,400,40,60 },
	{ 2100,370,40,60 },
	{ 2100,340,40,60 },
	{ 2100,310,40,60 },
	{ 2150,400,40,60 },
	{ 2150,370,40,60 },
	{ 2150,340,40,60 },
	{ 2150,310,40,60 },		//80

	{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}, //105
	{},{},{},{},{},{},{},{},{},{},//115
	{},{},{},{},{},	//120
	{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}, //150
	{},{},{},{},{},{},{},{},{},{},//160
	{},{},{},{},{}, //165
	{},{},{},{},{},
	{},{},{},{},{}, //175
	{},{},{},{},{},
	{},{},{},{},{},
	{},{},{},{},{}, 
	{},{},{},{},{}, 
	{},{},{},{},{}, //205
	
	{ 15760,440,40,60 },	// 대점프
	{ 15840,440,40,60 },
	{ 15920,440,40,60 },
	{ 16000,400,40,60 },
	{ 16050,350,40,60 },
	{ 16100,300,40,60 },
	{ 16150,250,40,60 },
	{ 16200,220,40,60 },
	{ 16250,220,40,60 },
	{ 16300,260,40,60 },
	{ 16350,300,40,60 },
	{ 16400,350,40,60 },
	{ 16450,400,40,60 },
	{ 16500,440,40,60 },
	{ 16550,440,40,60 },		// 215

	{},{},{},
	{},{},{},{},{},
	{},{},{},{},{},
	{},{},{},{},{},
	{},{},{},{},{},
	{},{},{},{},{},				//243
	{},{},{},{},{},
	{},{},{},{},{},
	{},{},{},{},{},				//258
	{},{},{},{},{},
	{},{},{},{},{},
	{},{},{}, {},{},{},{},{ 30400,240 },{ 30700,240 },{ 30550,310 },{ 30850,310 } ,
	{},{},{},{},{},{},{},{},{},{},
	};


	for (int i = 19; i < 29; ++i)
	{
		tJellyInfo[i] = { float(i * 80 + 400) , 450.f, 40.f, 60.f };
	}

	for (int i = 38; i < 63; ++i)
	{
		tJellyInfo[i] = { float(i * 80 + 400) , 450.f, 40.f, 60.f };
	}

	for (int i = 81; i < 85; ++i)
	{
		tJellyInfo[i] = { float(i * 80  -550) , 450.f, 40.f, 60.f };
	}

	for (int i = 91; i < 95; ++i)
	{
		tJellyInfo[i] = { float(i * 80 - 550) , 450.f, 40.f, 60.f };
	}


	for (int i = 96; i < 105; ++i)
	{
		tJellyInfo[i] = { float(i * 80 - 450) , 470.f, 40.f, 60.f };
	}

	for (int i = 0; i < 7; ++i)
	{
		for (int j = 0; j < 5; j++)
		{
			tJellyInfo[i * 5 + j + 110] = { float(i * 80 + 9800) , float(j * 50 + 200), 40.f, 60.f };
		}
	}
	for (int i = 110; i < 115; ++i)
	{
		tJellyInfo[i] = { float(i * 80 - 200) , 450.f, 40.f, 60.f };
	}

	for (int i = 0; i < 7; ++i)
	{
		for (int j = 0; j < 5; j++)
		{
			tJellyInfo[i * 5 + j + 115] = { float(i * 80 + 9000) , float(j * 50 + 200), 40.f, 60.f };	//150
		}
	}

	for (int i = 150; i < 159; ++i)
	{
		tJellyInfo[i] = { float(i * 80 + 1300) , 450.f, 40.f, 60.f };
	}
	for (int i = 159; i < 175; ++i)
	{
		tJellyInfo[i] = { float(i * 80 + 1500) , 470.f, 40.f, 60.f };
	}

	for (int i = 0; i < 5; ++i)
	{
		for (int j = 0; j < 5; j++)
		{
			tJellyInfo[i * 5 + j + 175] = { float(i * 80 + 15420) , float(j * 50 + 200), 40.f, 60.f };
		}
	}

	for (int j = 215; j < 218; j++)
	{
		tJellyInfo[j] = { float(j * 80 - 500) , 450.f , 40.f, 60.f };
	}


	for (int i = 0; i < 5; ++i)
	{
		for (int j = 0; j < 5; j++)
		{
			tJellyInfo[i * 5 + j + 218] = { float(i * 80 + 18500) , float(j * 50 + 200), 40.f, 60.f };
		}
	}



	for (int i = 0; i < 15; ++i)
	{
		tJellyInfo[i + 243] = { float(i * 80 + 23200) , 450.f, 40.f, 60.f };
	}


	for (int i = 0; i < 12; ++i)
	{
		tJellyInfo[i + 263] = { float(i * 80 + 30000) , 470.f, 40.f, 60.f };		// 2개 남음
	}

	for (int i = 0; i < 9; ++i)	//276
	{
		tJellyInfo[i + 280] = { float(i * 80 + 34300) , 450.f, 40.f, 60.f };
	}

	for (int i = 0; i < 2; ++i)	//276
	{
		tJellyInfo[i + 289] = { float(i * 80 + 35020) , 470.f, 40.f, 60.f };
	}
	for (int i = 0; i < 5; ++i)	//276
	{
		tJellyInfo[i + 293] = { float(i * 80 + 35180) , 450.f, 40.f, 60.f };
	}

	for (int i = 0; i < 3; ++i)	//276
	{
		tJellyInfo[i + 297] = { float(i * 80 + 35500) , 470.f, 40.f, 60.f };
	}


	for (int i = 0; i < 4; ++i)	//E
	{
		tJellyInfo[i + 300] = { float(i * 80 + 36800) , 150.f, 40.f, 60.f };
	}

	for (int i = 0; i < 4; ++i)
	{
		tJellyInfo[i + 304] = { float(i * 80 + 36800) , 310.f, 40.f, 60.f };
	}

	for (int i = 0; i < 4; ++i)	
	{
		tJellyInfo[i + 308] = { float(i * 80 + 36800) , 470.f, 40.f, 60.f };
	}

	tJellyInfo[312] = { float(36800) , 230.f, 40.f, 60.f };
	tJellyInfo[313] = { float(36800) , 390.f, 40.f, 60.f };


	for (int i = 0; i < 314; ++i)
	{
		m_JellyList.push_back(new CJelly(tJellyInfo[i].fX, tJellyInfo[i].fY));
	}


	for (auto& iter : m_JellyList)
	{
		iter->Initialize();
	}
}

void CJellyMgr::Update(void)
{
	for (auto& iter = m_JellyList.begin(); iter != m_JellyList.end();)
	{
		if ((*iter)->Update() == OBJ_DEAD)
		{
			Safe_Delete<CJelly*>(*iter);
			iter = m_JellyList.erase(iter);
		}
		else
		{
			++iter;
		}
	}
}

void CJellyMgr::Late_Update(void)
{
	for (auto& iter : m_JellyList)
	{
		iter->Late_Update();
	}
}

void CJellyMgr::Render(HDC hDC)
{
	for (auto& iter : m_JellyList)
	{
		iter->Render(hDC);
	}
}

void CJellyMgr::Release(void)
{
	for (auto iter = m_JellyList.begin(); iter != m_JellyList.end();)
	{
		(*iter)->Release();
		Safe_Delete<CJelly*>(*iter);

		iter = m_JellyList.erase(iter);
	}
}
